---
kind: type
id: T:Autodesk.Revit.DB.Structure.BracePlanRepresentation
source: html/fb5b7097-a49c-ede6-1ca0-4f6747e83e88.htm
---
# Autodesk.Revit.DB.Structure.BracePlanRepresentation

The possible representations for braces in plan views.

## Syntax (C#)
```csharp
public enum BracePlanRepresentation
```